<template>
  <pl-content-box>
    <p>这是一篇示例文章,文章篇幅超长,长到难以想象</p>
    <p>觉得有多长?可以告诉你,真的超长</p>
    <p>真的没骗你,不信你看看</p>
    <pl-affix :offset-top="40">
      <div class="affix-class">这是一个固钉</div>
    </pl-affix>
    <p>很长很长很长很长很长很长</p>
    <p>很长很长很长很长很长很长</p>
    <p>很长很长很长很长很长很长</p>
    <p>很长很长很长很长很长很长</p>
    <p>很长很长很长很长很长很长</p>
    <p>很长很长很长很长很长很长</p>
    <p>很长很长很长很长很长很长</p>
    <p>很长很长很长很长很长很长</p>
    <p>很长很长很长很长很长很长</p>
    <p>很长很长很长很长很长很长</p>
    <p>这个时候需要再给我一点空间</p>
    <p>让我再展示有多长</p>
    <p>很长很长很长很长很长很长</p>
    <p>很长很长很长很长很长很长</p>
    <p>很长很长很长很长很长很长</p>
    <p>很长很长很长很长很长很长</p>
    <p>很长很长很长很长很长很长</p>
    <p>很长很长很长很长很长很长</p>
    <p>很长很长很长很长很长很长</p>
    <p>很长很长很长很长很长很长</p>
    <p>很长很长很长很长很长很长</p>
    <p>很长很长很长很长很长很长</p>
    <p>这个时候需要再给我一点空间</p>
    <p>让我再展示有多长</p>
    <p>很长很长很长很长很长很长</p>
    <p>很长很长很长很长很长很长</p>
    <p>很长很长很长很长很长很长</p>
    <p>很长很长很长很长很长很长</p>
    <p>很长很长很长很长很长很长</p>
    <p>很长很长很长很长很长很长</p>
    <p>很长很长很长很长很长很长</p>
    <p>很长很长很长很长很长很长</p>
    <p>很长很长很长很长很长很长</p>
    <p>很长很长很长很长很长很长</p>
    <p>这个时候需要再给我一点空间</p>
    <p>让我再展示有多长</p>
  </pl-content-box>
</template>

<style lang="scss" rel="stylesheet/scss" scoped>
  div {
    margin: {
      left: 20px;
      top: 20px;
    }

    p{
      margin-top: 10px;
      font-size: 20px;
    }

    .affix-class{
      width: 150px;
      background-color: #00AAAA;
      font-size: 20px;
    }
  }
</style>

<script>
  export default {

  };
</script>
